app/Controllers/DashboardController.php

SELECT *
FROM `users`
WHERE `id` = '1'
---
    public function index()
    {

        helper(['form']);
        $UserModel = new UserModel();
        $data['users'] = $UserModel->where("id",session("id"))->findAll();