app/Controllers/LoginController.php

    public function process_login()
    {

        $session = session();
        $model = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1