app/Controllers/MailboxController.php

SELECT *
FROM `users`
WHERE `id` = '1'
---
    public function mail_box()
    {
        $UserModel = new UserModel();
        $data['users'] = $UserModel->where("id",session("id"))->findAll();

SELECT *
FROM `users`
WHERE `id` = '1'
---
    public function read_mail()
    {
        $UserModel = new UserModel();
        $data['users'] = $UserModel->where("id",session("id"))->findAll();

SELECT *
FROM `users`
WHERE `id` = '1'
---
    public function compose()
    {
        $UserModel = new UserModel();
        $data['users'] = $UserModel->where("id",session("id"))->findAll();