app/Controllers/RegisterController.php

    public function index()
    {
        helper(['form']);
        $data = [];
        $UserModel = new UserModel();
        $data['users'] = $UserModel->where("id",session("id"))->findAll();
---
SELECT *
FROM `users`
WHERE `id` = '1'